Revit 2027 API
Face.GetRegions Method
Gets the face regions (created, for example, by the Split Face command) of the face.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<Face> GetRegions()
Public Function GetRegions As IList(Of Face)
public:
IList<Face^>^ GetRegions()
member GetRegions : unit -> IList<Face>
Return Value
IList<Face>
A list of faces, one for the main face of the object hosting the Split Face (such as wall or floor) and one face for each Split Face regions.
Remarks
Use the FaceSplitter class to filter and find elements which may generate face regions.
See Also
Reference
Face Class
Autodesk.Revit.DB Namespace